Revit 2027 API
Marble.MarbleColor1 Property
 The property labeled "Stone Color" from the "Marble" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string MarbleColor1 { get; }
Public Shared ReadOnly Property MarbleColor1 As String
	Get
public:
static property String^ MarbleColor1 {
	String^ get ();
}
static member MarbleColor1 : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyDoubleArray4d". This property allows a connected asset.
See Also
Reference
Marble Class
Autodesk.Revit.DB.Visual Namespace